/*******************************************************/
/* Лабораторная работа = 1 */
/* Типы данных и ввод-вывод */
/* Пример выполнения. Вариант 16. */
/*******************************************************/
#include <stdio.h> 
#include <iostream> 
#include "Windows.h" 
int main(void) {
	char name1[8], name2[8], name3[8];
	char form1, form2, form3;
	unsigned int sq1, sq2, sq3;
	unsigned int cnt1, cnt2, cnt3;
	SetConsoleCP(1251);
	SetConsoleOutputCP(1251);
	/* Введение фактических данных*/
	printf("1. Введите: название, вид собственности, площадь земли(га), кол. работников >");
	scanf("%s %c %d %d", name1, &form1, &sq1, &cnt1);
	printf("2. Введите: название, вид собственности, площадь земли(га), кол. работников >");
	scanf("%s %c %d %d", name2, &form2, &sq2, &cnt2);
	printf("3. Введите: название, вид собственности, площадь земли(га), кол. работников >");
	scanf("%s %c %d %d", name3, &form3, &sq3, &cnt3);
	/* Вывод таблицы */
	/* вывод заголовков */
	printf("--------------------------------------------------------------------\n");
	printf("|              Сельскохозяйственные предприятия                    |\n");
	printf("|------------------------------------------------------------------|\n");
	printf("| Название | Вид собственности | Площадь земли (га)|Кол. работников|\n");
	printf("|----------|-------------------|-------------------|---------------|\n");
	/* вывод строк фактических данных */
	printf("| %-8s | %-17c | %-17d | %-13d |\n", name1, form1, sq1, cnt1);
	printf("| %-8s | %-17c | %-17d | %-13d |\n", name2, form2, sq2, cnt2);
	printf("| %-8s | %-17c | %-17d | %-13d |\n", name3, form3, sq3, cnt3);
	/* вывод примечаний */
	printf("|------------------------------------------------------------------|\n");
	printf("|       Вид собственности: Д - государственная; Ч - частная;       |\n");
	printf("|       К - кооперативная                                          |\n");
	printf("--------------------------------------------------------------------\n");
	system("pause");
	return 0;
}